app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
def index
    restaurants = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def show
    restaurant = Restaurant.find_by(id: params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 19]]
---
def destroy
    restaurants = Restaurant.find_by(id: params[:id])
    if restaurants
        render json: restaurants.destroy, status: :ok