app/controllers/restaurant_pizas_controller.rb

    def index
        restaurantPizzas = RestaurantPiza.all
---
SELECT "restaurant_pizas".* FROM "restaurant_pizas"

    def create
        restaurant_pizza = RestaurantPiza.create(restaurant_pizza_params)
---
INSERT INTO "restaurant_pizas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 10.0], ["restaurant_id", 4], ["pizza_id", 4], ["created_at", "2023-03-18 10:51:03.663349"], ["updated_at", "2023-03-18 10:51:03.663349"]]